{
    "matrix": [
        [
            {
                "title": "Listar",
                "description": "O estudante é estimulado a fazer uma síntese do conteúdo apresentado.",
                "color": "#8CD6FF"
            },
            {
                "title": "Descrever",
                "description": "Descrever (características, passos, propriedades, etapas, etc.) sobre o assunto.",
                "color": "#8CD6FF"
            },
            {
                "title": "Recordar ",
                "description": "O estudante é estimulado a criar familiaridade com o tema de modo que consiga recuperá-lo na memória e citá-lo numa narrativa.",
                "color": "#8CD6FF"
            },
            {
                "title": "Reconhecer",
                "description": "O estudante é estimulado a relacionar o conteúdo com outros conceitos prévios e a ser capaz de explicá-lo através de analogias e exemplos.",
                "color": "#8CD6FF"
            }
        ],
        [
            {
                "title": "Comparar",
                "description": "O estudante é estimulado a identificar similaridades e diferenças entre conceitos. Providenciando exemplos.",
                "color": "#95FF8C"
            },
            {
                "title": "Discutir",
                "description": "O estudante é estimulado a desenvolver senso crítico, baseados nos conhecimentos apresentados.",
                "color": "#95FF8C"
            },
            {
                "title": "Explicar",
                "description": "O estudante é estimulado a explicar os conceitos com suas próprias palavras, ilustrando o sentido a ideia principal.",
                "color": "#95FF8C"
            },
            {
                "title": "Predizer",
                "description": "O estudante é estimulado a antecipar resultados com base em informações disponíveis.",
                "color": "#95FF8C"
            }
        ],
        [
            {
                "title": "Determinar",
                "description": "O estudante é estimulado a conhecer e dominar as perguntas recorrentes quanto ao conteúdo.",
                "color": "#CCFF8C"
            },
            {
                "title": "Prover",
                "description": "O estudante é estimulado a fornecer suporte a outras pessoas quanto a execuções de tarefas sobre o conteúdo.",
                "color": "#CCFF8C"
            },
            {
                "title": "Realizar",
                "description": "O estudante aprendeu técnicas e procedimentos normalmente necessários para colocar o conteúdo em prática.",
                "color": "#CCFF8C"
            },
            {
                "title": "Usar",
                "description": "O estudante foi estimulado a utilizar os variados conhecimentos e técnias para execução de projetos reais.",
                "color": "#CCFF8C"
            }
        ],
        [
            {
                "title": "Selecionar",
                "description": "O estudante foi estimulado a selecionar informações relevantes para identificar padrões",
                "color": "#FDFF8C"
            },
            {
                "title": "Diferenciar",
                "description": "O aluno deve ser capaz de diferenciar conceitos, ideias ou categorias para compreensão mais aprofundada do assunto em questão.",
                "color": "#FDFF8C"
            },
            {
                "title": "Integrar",
                "description": "O estudante foi estimulado a integrar processos, combinando-os de forma coerente para resolver problemas complexos",
                "color": "#FDFF8C"
            },
            {
                "title": "Desconstruir",
                "description": "O aluno consegue desconstruir e refletir sobre seu próprio pensamento, identificando áreas de melhoria e ajustando sua abordagem para otimizar o desempenho cognitivo.",
                "color": "#FDFF8C"
            }
        ],
        [
            {
                "title": "Verificar",
                "description": "O estudante foi estimulado a verificar a precisão e validade das informações, fontes ou dados apresentados, garantindo a confiabilidade.",
                "color": "#FFCA8C"
            },
            {
                "title": "Determinar",
                "description": "O aluno deve ser capaz de determinar a relevância e importância de conceitos, teorias ou ideias, identificando sua aplicabilidade e impacto no contexto em questão",
                "color": "#FFCA8C"
            },
            {
                "title": "Julgar",
                "description": "O aluno deve ser capaz de julgar a eficácia e adequação de processos, métodos ou abordagens utilizadas, quanto ao alcance de objetivos específicos.",
                "color": "#FFCA8C"
            },
            {
                "title": "Refletir",
                "description": "O aluno deve ser capaz de avaliar a eficácia dos seus métodos de verificação, buscando melhorar sua estratégia.",
                "color": "#FFCA8C"
            }
        ],
        [
            {
                "title": "Gerar",
                "description": "O estudante foi estimulado a gerar novas informações, ideias ou soluções a partir de dados existentes, demonstrando originalidade e inovação no processo de pensamento.",
                "color": "#FF938C"
            },
            {
                "title": "Reunir",
                "description": "O estudante foi estimulado a reunir diferentes conceitos de forma integrada, criando novas abordagens para a resolução de problemas ou desenvolvimento de projetos.",
                "color": "#FF938C"
            },
            {
                "title": "Projetar",
                "description": "O aluno deve ser capaz de projetar e implementar soluções inovadoras, combinando diferentes etapas de forma coesa e eficaz para alcançar resultados significativos.",
                "color": "#FF938C"
            },
            {
                "title": "Criar",
                "description": "Ser capaz de guiar um pensamento crítico sobre seu próprio processo de criação, identificando oportunidades de melhoria, e explorando novas formas de expressão criativa.",
                "color": "#FF938C"
            }
        ]
    ],
    "dimensoes": [
        ["Lembrar", "Entender", "Aplicar", "Analisar", "Avaliar", "Criar"],
        ["Factual", "Conceitual", "Procedural", "Metacognitivo"]
    ]
}